Tekla.Structures.Analysis.AnalysisLoadCombination
The AnalysisLoadCombination class contains information related to analysis load combinations.

Tekla.Structures.Analysis.AnalysisLoadCombination._Name
The name of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination._Type
The type of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination._GroupIDs
The identifiers of the groups of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination._ScalingFactors
The scaling factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination._ReductionFactors
The reduction factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination._PartialSafetyFactors
The partial safety factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.Name
The name of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.Type
The combination type of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.GroupIDs
The identifiers of the groups of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.ScalingFactors
The scaling factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.ReductionFactors
The reduction factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.PartialSafetyFactors
The partial safety factors of the analysis load combination.

Tekla.Structures.Analysis.AnalysisLoadCombination.Insert
Inserts an analysis load combination.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisLoadCombination.Select
Selects an analysis load combination.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisLoadCombination.Modify
Modifies an analysis load combination.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisLoadCombination.Delete
Deletes an analysis load combination.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisLoadCombination.SetLoads(System.Collections.Generic.List{Tekla.Structures.Identifier},System.Collections.Generic.List{System.Double},System.Collections.Generic.List{System.Double},System.Collections.Generic.List{System.Double})
Sets the loads.
groupIDs: The group identifiers.
scalingFactors: The scaling factors.
reductionFactors: The reduction factors.
partialSafetyFactors: The partial safety factors.

Tekla.Structures.Analysis.AnalysisLoadCombination.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisLoadCombination.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisLoadCombination.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisLoadCombination.DeleteInstance
DO NOT USE! For internal usage only!